2018/regex.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2018-08-15 周三 09:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>正则表达式</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/org-html-theme-list/org-note/style/main.css"/>



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">正则表达式</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9a8e6c4">1. 简介</a></li>
<li><a href="#org01193bb">2. 简单的匹配</a></li>
<li><a href="#orge192e37">3. 子表达式</a></li>
<li><a href="#org27a0ba2">4. 回溯引用</a>
<ul>
<li><a href="#orgacdc600">4.1. 回溯引用在替换操作中的使用</a></li>
</ul>
</li>
<li><a href="#org95f2653">5. 前后查找</a>
<ul>
<li><a href="#org8258ab7">5.1. 向前查找</a></li>
<li><a href="#org7332289">5.2. 向后查找</a></li>
<li><a href="#orgb34f9f8">5.3. 对前后查找取非</a></li>
</ul>
</li>
<li><a href="#org7bf9916">6. 嵌入条件</a>
<ul>
<li><a href="#org3af79d7">6.1. 回溯引用条件</a></li>
<li><a href="#orgcb14e46">6.2. 前后查找条件</a></li>
</ul>
</li>
<li><a href="#org1ebe600">7. 正则表达式在线测试</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9a8e6c4" class="outline-2">
<h2 id="org9a8e6c4"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
正则表达式(regular expression, 缩写regex) 是文本处理方面功能最强大的工具之一.
</p>

<p>
正则表达式的两个基本用途是: <code>搜索</code> 和 <code>替换</code>.
</p>
</div>
</div>

<div id="outline-container-org01193bb" class="outline-2">
<h2 id="org01193bb"><span class="section-number-2">2</span> 简单的匹配</h2>
<div class="outline-text-2" id="text-2">
<p>
有时, 简单的组合正则表达式的 <b>元字符</b> 和 <b>纯文本</b> 便足够解决很多问题.
</p>

<ul class="org-ul">
<li><p>
<b>基本的元字符</b>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">元字符</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>.</code></td>
<td class="org-left">匹配任意单个字符</td>
</tr>

<tr>
<td class="org-left"><code>[]</code></td>
<td class="org-left">定义字符集合, 匹配字符集合中的一个字符</td>
</tr>

<tr>
<td class="org-left"><code>[^]</code></td>
<td class="org-left">对字符集合求非</td>
</tr>

<tr>
<td class="org-left"><code>-</code></td>
<td class="org-left">定义一个区间(如[A-Z])</td>
</tr>

<tr>
<td class="org-left"><code>\</code></td>
<td class="org-left">对下一个字符转义</td>
</tr>
</tbody>
</table>

<p>
<b>注</b>: 一个完整的正则表达式, <code>\</code> 字符后面必然跟着一个字符.
</p></li>

<li><p>
<b>数量元字符</b>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">元字符</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>*</code></td>
<td class="org-left">匹配前一个字符(子表达式)的零次或多次重复</td>
</tr>

<tr>
<td class="org-left"><code>*?</code></td>
<td class="org-left"><code>*</code> 的懒惰型版本</td>
</tr>

<tr>
<td class="org-left"><code>+</code></td>
<td class="org-left">匹配前一个字符(子表达式)的一次或多次重复</td>
</tr>

<tr>
<td class="org-left"><code>+?</code></td>
<td class="org-left"><code>+</code> 的懒惰型版本</td>
</tr>

<tr>
<td class="org-left"><code>?</code></td>
<td class="org-left">匹配前一个字符(子表达式)的零次或一次重复</td>
</tr>

<tr>
<td class="org-left"><code>{n}</code></td>
<td class="org-left">匹配前一个字符(子表达式)的 <code>n</code> 次重复</td>
</tr>

<tr>
<td class="org-left"><code>{m, n}</code></td>
<td class="org-left">匹配前一个字符(子表达式)至少 <code>n</code> 次且至多 m 次重复</td>
</tr>

<tr>
<td class="org-left"><code>{n, }</code></td>
<td class="org-left">匹配前一个字符(子表达式)至少 <code>n</code> 次重复</td>
</tr>

<tr>
<td class="org-left"><code>{n, }?</code></td>
<td class="org-left">{n, } 的懒惰型版本</td>
</tr>
</tbody>
</table>

<p>
<b>注</b>: <code>*</code> 和 <code>+</code> 在默认情况下是 <b>贪婪匹配</b>, 会匹配尽可能多的字符, 容易造成过度匹配.
所以在使用时, 考虑使用它的 <b>懒惰版本</b>.
</p></li>

<li><p>
<b>位置元字符</b>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">元字符</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>^</code></td>
<td class="org-left">匹配字符串的开头</td>
</tr>

<tr>
<td class="org-left"><code>\A</code></td>
<td class="org-left">匹配字符串的开头</td>
</tr>

<tr>
<td class="org-left"><code>$</code></td>
<td class="org-left">匹配字符串的结束</td>
</tr>

<tr>
<td class="org-left"><code>\Z</code></td>
<td class="org-left">匹配字符串的结束</td>
</tr>

<tr>
<td class="org-left"><code>\&lt;</code></td>
<td class="org-left">匹配单词的开头</td>
</tr>

<tr>
<td class="org-left"><code>\&gt;</code></td>
<td class="org-left">匹配单词的结束</td>
</tr>

<tr>
<td class="org-left"><code>\b</code></td>
<td class="org-left">匹配单词边界(开头和结束)</td>
</tr>

<tr>
<td class="org-left"><code>\B</code></td>
<td class="org-left"><code>\b</code> 的反义, 即单词内部</td>
</tr>
</tbody>
</table></li>

<li><p>
<b>特殊字符元字符</b>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">元字符</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>[\b]</code></td>
<td class="org-left">退格字符</td>
</tr>

<tr>
<td class="org-left"><code>\c</code></td>
<td class="org-left">匹配一个控制字符</td>
</tr>

<tr>
<td class="org-left"><code>\d</code></td>
<td class="org-left">匹配任意数字字符</td>
</tr>

<tr>
<td class="org-left"><code>\D</code></td>
<td class="org-left"><code>\d</code> 的反义</td>
</tr>

<tr>
<td class="org-left"><code>\f</code></td>
<td class="org-left">换页符</td>
</tr>

<tr>
<td class="org-left"><code>\n</code></td>
<td class="org-left">换行符</td>
</tr>

<tr>
<td class="org-left"><code>\r</code></td>
<td class="org-left">回车符</td>
</tr>

<tr>
<td class="org-left"><code>\s</code></td>
<td class="org-left">匹配一个空白字符</td>
</tr>

<tr>
<td class="org-left"><code>\S</code></td>
<td class="org-left"><code>\s</code> 的反义</td>
</tr>

<tr>
<td class="org-left"><code>\t</code></td>
<td class="org-left">制表符</td>
</tr>

<tr>
<td class="org-left"><code>\v</code></td>
<td class="org-left">垂直制表符</td>
</tr>

<tr>
<td class="org-left"><code>\w</code></td>
<td class="org-left">匹配任意字母数字或下划线字符</td>
</tr>

<tr>
<td class="org-left"><code>\W</code></td>
<td class="org-left"><code>\w</code> 的反义</td>
</tr>

<tr>
<td class="org-left"><code>\x</code></td>
<td class="org-left">匹配一个十六进制数字</td>
</tr>

<tr>
<td class="org-left"><code>\0</code></td>
<td class="org-left">匹配一个八进制数字</td>
</tr>
</tbody>
</table>

<p>
<b>注</b>: <code>Windows</code> 使用 <code>\r\n</code> 作为文本行结束标签. <code>Unix\Linux</code> 使用 <code>\n</code>.
</p></li>

<li><p>
<b>POSIX字符类</b>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">字符类</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>[:alnum:]</code></td>
<td class="org-left">任何一个字母或数字</td>
</tr>

<tr>
<td class="org-left"><code>[:alpha:]</code></td>
<td class="org-left">任何一个字母</td>
</tr>

<tr>
<td class="org-left"><code>[:blank:]</code></td>
<td class="org-left">空格或制表符</td>
</tr>

<tr>
<td class="org-left"><code>[:cntrl:]</code></td>
<td class="org-left">ASCII 控制字符(ASCII 0-31, 127)</td>
</tr>

<tr>
<td class="org-left"><code>[:digit:]</code></td>
<td class="org-left">任何一个数字</td>
</tr>

<tr>
<td class="org-left"><code>[:graph:]</code></td>
<td class="org-left">和 <code>[:print:]</code> 一样, 但不包括空格</td>
</tr>

<tr>
<td class="org-left"><code>[:lower:]</code></td>
<td class="org-left">任何一个小写字母</td>
</tr>

<tr>
<td class="org-left"><code>[:print:]</code></td>
<td class="org-left">任何一个可打印字符</td>
</tr>

<tr>
<td class="org-left"><code>[:punct:]</code></td>
<td class="org-left">既不属于 <code>[:alnum:]</code> 也不属于 <code>[:cntrl:]</code> 的任何一个字符</td>
</tr>

<tr>
<td class="org-left"><code>[:space:]</code></td>
<td class="org-left">任何一个空白字符, 包括空格</td>
</tr>

<tr>
<td class="org-left"><code>[:upper:]</code></td>
<td class="org-left">任何一个大写字符</td>
</tr>

<tr>
<td class="org-left"><code>[:xdigit:]</code></td>
<td class="org-left">任何一个十六进制数字</td>
</tr>
</tbody>
</table>

<p>
<b>注</b>: 部分工具或编程语言不支持.
</p></li>
</ul>

<p>
通过使用这些元字符和纯文本的组合已经可以解决很多问题, 但是很多时候, 仅靠这些元字符能够
解决的问题是有限的, 这时, 便需要用到更高级的功能.
</p>
</div>
</div>

<div id="outline-container-orge192e37" class="outline-2">
<h2 id="orge192e37"><span class="section-number-2">3</span> 子表达式</h2>
<div class="outline-text-2" id="text-3">
<p>
子表达式可以对表达式进行 <b>分组</b> 和 <b>归类</b>.
</p>

<p>
子表达式必须用 <code>(</code> 和 <code>)</code> 括起来. <code>(</code> 和 <code>)</code> 是元字符, 要匹配它们需要用 <code>\</code> 转义.
</p>

<p>
对于子表达式, 常用的一个例子是匹配 <code>IP</code> 地址.
</p>

<p>
假设一段文本是这样的:
</p>
<pre class="example">
The ip address is: [12.159.46.200]

</pre>

<p>
我们要从中匹配出 <code>IP</code> 地址, 简单的做法可以像这样:
</p>
<pre class="example">
\d{1, 3}\.\d{1, 3}\.\d{1, 3}\.\d{1, 3}

</pre>

<p>
<code>\d{1, 3}</code> 匹配连续的一到三个数字, <code>\.</code> 匹配字符 <code>.</code>, 这时, 虽然我们可以
从示例文本中匹配出 <code>IP</code> 地址, 但是很繁琐.
</p>

<p>
这时, 如果使用子表达式就会很简单:
</p>
<pre class="example">
(\d{1, 3}\.){3}\d{1, 3}

</pre>

<p>
<code>(\d{1, 3}\.){3}</code> 表示匹配连续的一到三个数字和一个点三次, 而 <code>(\d{1, 3})\.)</code>
便是子表达式.通过括号括起来的一段表达式, 方便重复的匹配.
</p>

<p>
另外, 在子表达式内部, 你可以用元字符 <code>|</code> 来将子表单式分为两个部分. 相当于C语言中的 <code>||</code>,
只要两部分中的一个匹配成功就算匹配成功. 如: <code>(19|20)\d</code> 匹配 <code>19x</code> 或 <code>20x</code> 的数字.
</p>

<p>
同时, 子表达式允许嵌套, 嵌套的层次理论上没有限制, 但是嵌套太多不是一个好主意.
</p>

<p>
如: <code>(([A-Z]{2})|([a-z]{2}))</code> 可以匹配两个连续的大写字母或两个连续的小写字母.
</p>
</div>
</div>

<div id="outline-container-org27a0ba2" class="outline-2">
<h2 id="org27a0ba2"><span class="section-number-2">4</span> 回溯引用</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>回溯引用</b> 允许正则表达式模式引用前面部分中定义的 <b>子表达式</b> 匹配的 <b>结果</b>.
</p>

<p>
<b>回溯引用</b> 的表示方式是 <code>\</code> 后紧跟一个 <code>数字</code>, 如: <code>\1</code> 表示前面定义的 <b>第一个</b> 子表达式.
(<code>\0</code> 一般代表整个匹配模式).
</p>

<p>
例如, 对于一段网页文本:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="font-weight: bold;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;"> title1 </span>&lt;/<span style="font-weight: bold;">h1</span>&gt;
&lt;<span style="font-weight: bold;">h2</span>&gt;<span style="font-weight: bold; font-style: italic; text-decoration: underline;"> title2 </span>&lt;/<span style="font-weight: bold;">h2</span>&gt;
&lt;<span style="font-weight: bold;">h2</span>&gt; title3 &lt;/<span style="font-weight: bold;">h3</span>&gt;
&lt;<span style="font-weight: bold;">h4</span>&gt;<span style="text-decoration: underline;"> title4 </span>&lt;/<span style="font-weight: bold;">h4</span>&gt;
</pre>
</div>

<p>
很明显, 其中第三个标题的格式是错误的, 如果要匹配出正确的标题, 我们可以使用 <b>回溯引用</b> 来办到:
</p>
<pre class="example">
&lt;h([1-6])&gt;.*?&lt;/h\1&gt;

</pre>

<p>
这个匹配模式使用的 <b>回溯引用</b>, <code>\1</code> 引用了子表达式 <code>([1-6])</code> 的匹配 <b>结果</b>, 当前面的子表达式匹配到
一个数字的时候, 回溯引用代表的数字便是匹配到的这一个数字. 此时只有前后相同时才可以匹配成功.
</p>
</div>

<div id="outline-container-orgacdc600" class="outline-3">
<h3 id="orgacdc600"><span class="section-number-3">4.1</span> 回溯引用在替换操作中的使用</h3>
<div class="outline-text-3" id="text-4-1">
<p>
你可以在替换时引用匹配时使用的子表达式.
</p>

<p>
假设有一段文本:
</p>
<pre class="example">
=123=, =456=, =789=....
</pre>

<p>
你想讲所有的 <code>=xxx=</code> 替换为 <code>+xxx+</code>, 这时, 便可以使用回溯引用.
</p>

<p>
匹配模式: <code>=(\d{3})=</code>
</p>

<p>
替换模式: <code>+\1+</code>
</p>

<p>
替换结果:
</p>
<pre class="example">
+123+, +456+, +789+....

</pre>

<p>
<b>注</b>: <code>JavaScript</code> 请使用 <code>$</code> 替换 <code>\</code>.
</p>

<ul class="org-ul">
<li><p>
<b>大小写转换</b>
</p>

<p>
部分正则表达式允许使用以下元字符对字母进行大小写转换:
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">元字符</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">\E</td>
<td class="org-left">结束 \L 或 \U 的转换</td>
</tr>

<tr>
<td class="org-left">\l</td>
<td class="org-left">把下一个字符(子表达式)转换为小写</td>
</tr>

<tr>
<td class="org-left">\L</td>
<td class="org-left">把 \L 到 \E 之间的字符全部转换为小写</td>
</tr>

<tr>
<td class="org-left">\u</td>
<td class="org-left">把下一个字符(子表达式)转换为大写</td>
</tr>

<tr>
<td class="org-left">\U</td>
<td class="org-left">把 \U 到 \E 之间的字符全部转换为大写</td>
</tr>
</tbody>
</table>

<p>
例如, 将正确的标题转换为大写:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="font-weight: bold;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;"> title1 </span>&lt;/<span style="font-weight: bold;">h1</span>&gt;
&lt;<span style="font-weight: bold;">h2</span>&gt;<span style="font-weight: bold; font-style: italic; text-decoration: underline;"> title2 </span>&lt;/<span style="font-weight: bold;">h2</span>&gt;
&lt;<span style="font-weight: bold;">h2</span>&gt; title3 &lt;/<span style="font-weight: bold;">h3</span>&gt;
&lt;<span style="font-weight: bold;">h4</span>&gt;<span style="text-decoration: underline;"> title4 </span>&lt;/<span style="font-weight: bold;">h4</span>&gt;
</pre>
</div>

<p>
匹配模式: <code>&lt;h([1-6])&gt;(.*?)&lt;/h\1&gt;</code>
</p>

<p>
替换模式: <code>&lt;h\1&gt;\u\2&lt;/h\1&gt;</code>
</p>

<p>
替换结果:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="font-weight: bold;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;"> TITLE1 </span>&lt;/<span style="font-weight: bold;">h1</span>&gt;
&lt;<span style="font-weight: bold;">h2</span>&gt;<span style="font-weight: bold; font-style: italic; text-decoration: underline;"> TITLE2 </span>&lt;/<span style="font-weight: bold;">h2</span>&gt;
&lt;<span style="font-weight: bold;">h2</span>&gt; title3 &lt;/<span style="font-weight: bold;">h3</span>&gt;
&lt;<span style="font-weight: bold;">h4</span>&gt;<span style="text-decoration: underline;"> TITLE4 </span>&lt;/<span style="font-weight: bold;">h4</span>&gt;
</pre>
</div></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org95f2653" class="outline-2">
<h2 id="org95f2653"><span class="section-number-2">5</span> 前后查找</h2>
<div class="outline-text-2" id="text-5">
<p>
使用正则表达式标记要匹配的文本的位置, 对该位置的前后内容进行查找.
</p>

<p>
很多时候, 我们想要匹配位于网页 <code>&lt;title&gt;</code> 标签类的文本. 此时我们便可以使用
前后查找来完成工作.
</p>

<p>
前后查找分为: <b>向前查找</b> 和 <b>向后查找</b> (常见的正则表达式实现都支持前者, 但支持后者的就没那么多).
</p>
</div>

<div id="outline-container-org8258ab7" class="outline-3">
<h3 id="org8258ab7"><span class="section-number-3">5.1</span> 向前查找</h3>
<div class="outline-text-3" id="text-5-1">
<p>
向前查找指定了一个必须匹配但不在结果中返回的模式.
</p>

<p>
向前查找是由 <code>?=</code> 开头的 <b>子表达式</b>. 需要匹配的文本跟在 <code>=</code> 后面.
</p>

<p>
例如匹配这段文本的URL前缀:
</p>
<pre class="example">
https://github.com
https://gayhub.com
ftp://@_@.com
</pre>

<p>
匹配模式: <code>.+(?=:)</code>
</p>

<p>
匹配结果:
</p>
<pre class="example">
https
https
ftp
</pre>

<p>
任何一个子表达式都可以转换为一个向前查找表达式, 只要给他加上一个 <code>?=</code> 前缀即可.
</p>
</div>
</div>

<div id="outline-container-org7332289" class="outline-3">
<h3 id="org7332289"><span class="section-number-3">5.2</span> 向后查找</h3>
<div class="outline-text-3" id="text-5-2">
<p>
向后查找类似于向前查找, 操作符是: <code>?&lt;=</code>
</p>

<p>
例如匹配 <code>&lt;title&gt;</code> 标签之间的文本, 我们可以这样操作:
</p>
<pre class="example">
(?&lt;=&lt;title&gt;).*?(?=&lt;/title&gt;)

</pre>
</div>
</div>

<div id="outline-container-orgb34f9f8" class="outline-3">
<h3 id="orgb34f9f8"><span class="section-number-3">5.3</span> 对前后查找取非</h3>
<div class="outline-text-3" id="text-5-3">
<p>
前面两种查找方式为: <code>正向前查找</code> 和 <code>正向后查找</code>.
</p>

<p>
既然有正, 自然有负, 负向查找与给定模式不匹配的文本.
</p>

<p>
负向前查找: <code>(?!)</code>
</p>

<p>
负向后查找: <code>(?&lt;!)</code>
</p>

<p>
如: 有数字 <code>$123, 567, $23, 55</code>, 模式 <code>(?&lt;=\$)\d+)</code> 匹配 <code>$123, $23</code>.
而模式 <code>(?&lt;!\$)\d</code> 匹配 <code>567, 55</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org7bf9916" class="outline-2">
<h2 id="org7bf9916"><span class="section-number-2">6</span> 嵌入条件</h2>
<div class="outline-text-2" id="text-6">
<p>
<b>注</b>: 并非所有正则表达式实现都支持条件处理.
</p>

<p>
正则表达式里的条件用 <code>?</code> 来定义, 如: <code>?, ?=, ?&lt;=</code> 也算是条件查找了.
</p>

<p>
嵌入条件的使用情况:
</p>
<ul class="org-ul">
<li>根据有关回溯引用来进行条件处理</li>
<li>根据一个前后查找来进行条件处理</li>
</ul>
</div>

<div id="outline-container-org3af79d7" class="outline-3">
<h3 id="org3af79d7"><span class="section-number-3">6.1</span> 回溯引用条件</h3>
<div class="outline-text-3" id="text-6-1">
<p>
回溯引用条件只在前面的子表达式匹配取得成功的情况下才允许使用一个表达式.
</p>

<p>
语法: <code>(?(backreference)true-regex)</code>, 其中 <code>?</code> 表明这是一个条件, 括号里的 <code>backreference</code> 是一个回溯引用.
<code>true-regex</code> 是一个只在 <code>backreference</code> 存在时才被执行的表达式.
</p>

<p>
或: <code>(?(backreference)true-regex|false-regex)</code>, 当 <code>backreference</code> 不存在时执行 <code>false-regex</code> 表达式.
</p>

<p>
如模式: <code>(0X)?(?(1)[A-F0-9]{6}|\d{6})</code>
</p>

<p>
这个模式的前面部分为: <code>(0X)?</code>, 当这个条件满足的时候, 后面的条件将会执行: <code>[A-F0-9]{6}</code>, 而
不满足的时候会执行: <code>\d{6}</code>.
</p>

<p>
<b>注</b>: 回溯引用条件中的 <code>(1)</code> 不需要加 <code>\</code>, 即不需要 <code>(\1)</code> 这样.
</p>
</div>
</div>

<div id="outline-container-orgcb14e46" class="outline-3">
<h3 id="orgcb14e46"><span class="section-number-3">6.2</span> 前后查找条件</h3>
<div class="outline-text-3" id="text-6-2">
<p>
前后查找条件只在一个向前查找或一个向后查找取得成功的情况下才允许使用一个表达式.
</p>

<p>
语法: <code>(?(look-regex)true-regex)</code> <code>(look-regex)</code> 是一个向前或向后查找表达式, <code>true-regex</code> 是在
向前或向后查找成功后执行的子表达式.
</p>

<p>
如模式: <code>\d{5}(?(?=-)-\d{4})</code>, <code>(?=-)</code> 定义了一个向前查找表达式, 当查找成功后, 会执行 <code>-\d{4}</code> 表达式.
</p>
</div>
</div>
</div>

<div id="outline-container-org1ebe600" class="outline-2">
<h2 id="org1ebe600"><span class="section-number-2">7</span> 正则表达式在线测试</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://c.runoob.com/front-end/854">正则表达式在线测试|菜鸟教程</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明:自由转载-非商用-非衍生-保持署名(<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">创意共享3.0许可证</a>)
           <div id="disqus_thread"></div>
           <script type="text/javascript">
             var disqus_shortname = 'rgb-24bit';
             (function() {
               var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
               dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
               (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
             })();
           </script>
</div>
</body>
</html>
